Using the configuration suggested by @baynezy I get:

```
No attribute specified when one (and only one) of

[rule[0].filter[0].prefix.<.object_size_greater_than,rule[0].filter[0].prefix.<.object_size_less_than,rule[0].filter[0].prefix.<.and,rule[0].filter[0].prefix.<.tag]

is required


This will be an error in a future version of the provider
```

so it seems that the `filter {}` block and all the options inside it are not optional also because I can see in plan:
```
  ~ resource "aws_s3_bucket_lifecycle_configuration" "s3-lifecycle" {
        id                                     = "my-bucket"
        # (3 unchanged attributes hidden)

      ~ rule {
            id     = "keep-only-two-versions"
          + prefix = (known after apply)
            # (1 unchanged attribute hidden)

          + filter {
              + object_size_greater_than = (known after apply)
              + object_size_less_than    = (known after apply)
              + prefix                   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
    }
 ```

also "`+ prefix = (known after apply)` is something that it's adding by himself...I have not this on my code.